hi @jialei-chen - thanks for replying. I do want to mention that `terraform plan` works as expected - 

```tf
locals {
  equip_return_sites = [
    "www.telus.com/en/support/article/cancel-telus-home-services",
    "www.telus.com/en/support/article/equipment-warranty-upgrades-returns*"
  ]
}

resource "google_discovery_engine_target_site" "equip_return_site" {
  for_each      = contains(["lab", "np"], var.env) ? { for idx, site in local.equip_return_sites : idx => site } : {}
  project       = var.project_id
  location      = "global"
  data_store_id = google_discovery_engine_data_store.ds_ffh_equipment_return[0].data_store_id
  type          = "INCLUDE"
  exact_match   = true

  provided_uri_pattern = each.value
}
```

Output:
```
Step #2 - "terraform-plan": Terraform will perform the following actions:
Step #2 - "terraform-plan": 
Step #2 - "terraform-plan":   # google_discovery_engine_target_site.equip_return_site["0"] will be created
Step #2 - "terraform-plan":   + resource "google_discovery_engine_target_site" "equip_return_site" {
Step #2 - "terraform-plan":       + data_store_id          = "ds_ffh_equipment_return"
Step #2 - "terraform-plan":       + exact_match            = true
Step #2 - "terraform-plan":       + failure_reason         = (known after apply)
Step #2 - "terraform-plan":       + generated_uri_pattern  = (known after apply)
Step #2 - "terraform-plan":       + id                     = (known after apply)
Step #2 - "terraform-plan":       + indexing_status        = (known after apply)
Step #2 - "terraform-plan":       + location               = "global"
Step #2 - "terraform-plan":       + name                   = (known after apply)
Step #2 - "terraform-plan":       + project                = "cdo-ccai-lab-f7edc3"
Step #2 - "terraform-plan":       + provided_uri_pattern   = "www.telus.com/en/support/article/cancel-telus-home-services"
Step #2 - "terraform-plan":       + root_domain_uri        = (known after apply)
Step #2 - "terraform-plan":       + site_verification_info = (known after apply)
Step #2 - "terraform-plan":       + target_site_id         = (known after apply)
Step #2 - "terraform-plan":       + type                   = "INCLUDE"
Step #2 - "terraform-plan":       + update_time            = (known after apply)
Step #2 - "terraform-plan":     }
Step #2 - "terraform-plan": 
Step #2 - "terraform-plan":   # google_discovery_engine_target_site.equip_return_site["1"] will be created
Step #2 - "terraform-plan":   + resource "google_discovery_engine_target_site" "equip_return_site" {
Step #2 - "terraform-plan":       + data_store_id          = "ds_ffh_equipment_return"
Step #2 - "terraform-plan":       + exact_match            = true
Step #2 - "terraform-plan":       + failure_reason         = (known after apply)
Step #2 - "terraform-plan":       + generated_uri_pattern  = (known after apply)
Step #2 - "terraform-plan":       + id                     = (known after apply)
Step #2 - "terraform-plan":       + indexing_status        = (known after apply)
Step #2 - "terraform-plan":       + location               = "global"
Step #2 - "terraform-plan":       + name                   = (known after apply)
Step #2 - "terraform-plan":       + project                = "cdo-ccai-lab-f7edc3"
Step #2 - "terraform-plan":       + provided_uri_pattern   = "www.telus.com/en/support/article/equipment-warranty-upgrades-returns*"
Step #2 - "terraform-plan":       + root_domain_uri        = (known after apply)
Step #2 - "terraform-plan":       + site_verification_info = (known after apply)
Step #2 - "terraform-plan":       + target_site_id         = (known after apply)
Step #2 - "terraform-plan":       + type                   = "INCLUDE"
Step #2 - "terraform-plan":       + update_time            = (known after apply)
Step #2 - "terraform-plan":     }
Step #2 - "terraform-plan": 
Step #2 - "terraform-plan": Plan: 2 to add, 0 to change, 0 to destroy.
```